examples/tobias_tutorial/vertical_axial_wind_turbine_ncc/templates/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  www.openfoam.org                      |
|   \\  /    A nd           | Version:  12                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.003;

boundaryField
{
    #includeEtc         "caseDicts/setConstraintTypes"

    AMI
    {
        type            zeroGradient;
    }

    AMI_slave
    {
        type            zeroGradient;
    }

    inlet
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    4*0.08/3.3*0.07; // Inlet hydraulic diameter * 0.07
        value           $internalField;
    }

    outlet 
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    top
    {
        type            zeroGradient;
    }

    bottom 
    {
        type            zeroGradient;
    }

    VAWT 
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
}

// ************************************************************************* //
